# Используем официальный стабильный образ Node.js
FROM node:20

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем файлы package.json и package-lock.json для установки зависимостей
# Это кэширует слой с node_modules, если зависимости не менялись
COPY package*.json ./

# Выполняем установку зависимостей ВНУТРИ контейнера
RUN npm install

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Открываем порт, на котором будет работать Express-сервер
EXPOSE 3001

# Команда для запуска приложения при старте контейнера
CMD [ "npm", "start" ]
